{
  "lastUpdated": "2025-10-09T06:37:42.992Z",
  "articles": [
    {
      "title": "Vietnam, Laos boost cooperation in education quality improvement",
      "description": "Vietnam, Laos boost cooperation in education quality improvement\n\nThursday, 11:58, 09/10/2025\n\nVOV.VN - Vietnam and Laos are working together to enhance education quality, with a training course on primary school self-assessment opening in Vientiane on October 9.\n\nThe event, held in a hybrid format, brought together education managers, officials, and teachers from both countries. It is part of a joint initiative between the Vietnamese Ministry of Education and Training (MoET) and the Lao Ministry of Education and Sports to build stronger education quality management systems.\n\nIn his opening speech, Huynh Van Chuong, Director General of the Quality Management Department under Vietnam's MoET, said the 2021-2030 plan to strengthen education quality management focuses on two main goals: improving the capacity of Lao education officials, specialists, and teachers in conducting self-assessments of primary school quality; and helping them meet the requirements of Laos's national primary education curriculum.\n\nHe noted that the course aims to equip about 150 Lao officials and teachers with the ability to conduct self-assessments and improve school quality based on Laos's national standards, while effectively applying new methods, tools, and criteria in teaching and school management.\n\nAs part of the plan, training activities, professional exchanges, and on-site practice sessions will be held in both Vietnam and Laos. The program centers on three key areas, including sharing Vietnam's experience in building and operating education quality assurance systems; developing a core group of Lao educators capable of independently carrying out school-level assessments and quality improvements; and strengthening cooperation in sharing learning resources, tools, and digital systems for education quality management.\n\nThe training course reflects the spirit of cooperation, sharing, and joint development between the two education sectors. The great friendship, special solidarity, and comprehensive cooperation between Vietnam and Laos, nurtured by generations of leaders, remain a priceless asset, with education cooperation continuing to be a highlight of bilateral ties.\n\nVietnam, Laos strengthen cooperation in STEM and Robotics education\n\nA workshop and hands-on training on Science, Technology, Engineering and Mathematics (STEM) and Robotics education was held in Kaysone Phomvihane city in Savannakhet province of Laos on September 26-27, attracting a large number of officials and teachers from both Vietnam and Laos.\n\nVOV\n\nMời quý độc giả theo dõi VOV.VN trên",
      "url": "https://english.vov.vn/en/society/vietnam-laos-boost-cooperation-in-education-quality-improvement-post1236548.vov",
      "source": {
        "title": "VOV - VOV Online Newspaper"
      },
      "date": "2025-10-09T04:58:00Z",
      "image": "https://media.vov.vn/sites/default/files/styles/og_image_en/public/2025-10/VN-Lao%20coooperation.jpg?v=1759986263"
    },
    {
      "title": "Globen School shines at 2025 ENJOY AI African Robotics competition - MyJoyOnline",
      "description": "Globen School has once again asserted its dominance in the field of robotics education, emerging with three major awards at the 2025 ENJOY AI African Open Robotics Competition, held at the Accra Digital Centre.\n\nThis prestigious annual continental championship brought together young innovators and future technologists from across Africa, united under this year's inspiring theme: \"Chasing the Stars.\"\n\nThe competition saw participation from schools and robotics clubs representing Ghana, Kenya, Ivory Coast, and Gabon, offering students a unique platform to showcase their skills in design, problem-solving, and teamwork using cutting-edge robotics technologies.\n\nGloben School's robotics teams delivered an exceptional performance, clinching:\n\nThese accolades highlight the school's consistent dedication to STEM excellence, underpinned by robust investment in technology-enhanced learning and an innovative robotics curriculum.\n\nThe ENJOY AI African Open not only tested students' technical abilities but also offered real-world exposure to emerging industry practices in robotics and automation.\n\nFor the young participants, it was an opportunity to sharpen their communication, develop collaborative skills, and grow in confidence qualities that extend well beyond the classroom.\n\nGloben School's success is being widely celebrated as a reflection of its holistic educational approach, which blends academic rigour with creativity, practical engagement, and mentorship.",
      "url": "https://www.myjoyonline.com/globen-school-shines-at-2025-enjoy-ai-african-robotics-competition/",
      "source": {
        "title": "MyJoyOnline.com"
      },
      "date": "2025-10-06T17:11:35Z",
      "image": "https://www.myjoyonline.com/wp-content/uploads/2025/10/image-498.png"
    },
    {
      "title": "Goa shines at WSRO Nationals 2025: Young innovators make their mark in Robotics and STEM",
      "description": "New Delhi: Goa's young tech minds brought immense pride to the state at the World STEM & Robotics Olympiad (WSRO) National Championship 2025, held in Ahmedabad, Gujarat. Teams from across India participated in multiple STEM and Robotics challenges, with Goa teams delivering a remarkable all-round performance across various categories -- from robotics design and programming to energy innovation and scientific research.\n\nOrganizers and Partners\n\nThe WSRO National Championship 2025 is jointly organized and supported by the Happiness Reserves Foundation, Chiripal Group, the Department of Science and Technology (DST), and Gujarat Science City, Ahmedabad.\n\nThe entire competition is conducted under the visionary leadership of Mr. Vishal Chiripal - Founder and Robotics Enthusiast, WSRO, whose continued efforts have been instrumental in inspiring young innovators across India.\n\nOutstanding Achievements by Goa Teams\n\nVedang Anay Kamat - Saraswat Vidyalaya, Mapusa\n\n1st Place - Industry 4.0 Challenge (Mentor: Anay Kamat)\n\n3rd Place - Drone Flying (Mentor: Anay Kamat)\n\n4th Place - Junior Robo Race (Mentor: Anay Kamat)\n\n3rd Place - Lego Line Following (Mentor: Anay Kamat)\n\n(A 100% strike rate - winning in every category participated!)\n\nShlok R. Juvatkar - Mahila & Nutan English High School\n\n1st Place - Junior Robo Race (Mentor: Mahadev Mishal)\n\nBhargav M. Shirvant - Mahila & Nutan English High School\n\nJudges' Choice Award - Junior Robo Race (Mentor: Mahadev Mishal)\n\nNirbhay Manoj Talkar - Pradnya High School\n\n1st Place - Junior Line Following (Non-Lego) (Mentor: Prasad Shambhu Gadekar)\n\nRonav Chodankar & Ariana Chodankar - Sharada Mandir School\n\nJudges' Choice Award - Young Scientist (All STEM - Open Category) (Mentor: Dr. Deepa Chodankar)\n\nI\n\nan Calisto Nunes - St. Bartholomew's High School\n\nJudges' Choice Award - Young Scientist Energy - Algorithms (Open Source) (Mentor: Vincent Paul Toscano)\n\nSurabhi - Saraswat Vidyalaya, Mapusa\n\nJudges' Choice Award - Industry 4.0 Challenge (Mentor: Shubhesh Manerikar)\n\nGoa leads the way in Robotics Education\n\nSpeaking on the occasion, Mr. Yogesh Kerkar, Managing Director of Qurious Mind Infotainment Pvt. Ltd., congratulated all winners and mentors for their exceptional performance:\n\n\"These young innovators are proof that Goa is rapidly emerging as a hub for robotics and STEM education. Their creativity, problem-solving mindset, and teamwork exemplify the true spirit of innovation.\"\n\nHon. Chief Minister of Goa, Dr. Pramod Sawant, also extended his heartfelt congratulations to the winning students and mentors:\n\n\"I am extremely proud of our Goan students for showcasing their talent and innovation at a national platform like WSRO. These young minds represent the future of India's technological journey and embody the vision of Atmanirbhar Bharat and the National Education Policy 2020. The Government of Goa remains committed to supporting such initiatives that empower our youth through science, technology, and innovation.\"\n\nIn a significant development, Qurious Mind Infotainment Pvt. Ltd. has also signed a Memorandum of Understanding (MoU) with the organizers of WSRO to host the WSRO National Championship 2026 in Goa. This collaboration marks a proud milestone for the state, setting the stage for Goa to become a national hub for robotics, AI, and STEM innovation.\n\nThe WSRO Nationals 2025 served as a platform for young learners to explore cutting-edge technologies, collaborate with peers, and represent Goa at the national level. With several participants now qualifying for the WSRO International Championships in Dubai, Goa's robotics movement continues to inspire the next generation of engineers, scientists, and changemakers.",
      "url": "https://www.news9live.com/india/goa-shines-at-wsro-nationals-2025-young-innovators-make-their-mark-in-robotics-and-stem-2894725",
      "source": {
        "title": "News9live"
      },
      "date": "2025-10-06T14:03:55Z",
      "image": "https://images.news9live.com/wp-content/uploads/2025/10/Natipna.png"
    },
    {
      "title": "Vietnam launches robotics championship to select teams for global finals",
      "description": "The Vietnam VEX Robotics National Championship 2026 has officially begun, with regional qualifiers across the country set to identify top student teams to represent Vietnam at the VEX Robotics World Championship in the United States in April 2026.\n\nOn October 2, the Vietnam VEX Robotics National Championship 2026 launched at the National Innovation Center, marking the beginning of a nationwide search for outstanding student teams to compete in the world's largest robotics competition.\n\nThe event provides a platform for students to hone their robotics skills, engage in competitive play, and connect with the broader robotics community in Vietnam.\n\nThe kickoff round drew 31 teams from various schools nationwide, competing in two main divisions: VEX IQ (elementary and middle school) and VEX V5 (high school and up).\n\nThe VEX IQ competition theme, \"Mix and Match,\" challenges teams to stack items and place them in designated target zones. Teams must demonstrate teamwork in a 60-second challenge, manual driving skills, and autonomous programming.\n\nThe VEX V5 competition follows the theme \"Push Back,\" a high-intensity contest focusing on speed, power, and strategy. Participants must design robots capable of both defense and offense to dominate the field and score points.\n\nIn the kickoff round, the alliance team from Archimedes Academy Primary School and Cau Giay Secondary School (Hanoi) took first place in the VEX IQ elementary division.\n\nThe top middle school team was an alliance of students from Ly Tu Trong Secondary School (Phu Tho) and three Hanoi-based schools: Olympia, Vinschool, and Edison.\n\nIn the VEX V5 division, the standout performers were teams from Vinschool and Brighton College Vietnam.\n\nTran Thi Thao, Director of Vietnam Robotics Education & Competition, emphasized that the championship offers students across all age groups a valuable opportunity to practice designing, building, programming, and competing with robots. She noted that the contest cultivates creativity, problem-solving, teamwork, and global networking skills in STEM.\n\nHoang Van Dong, founder of KidsCode Education JSC and technical sponsor of the event, stated that the kickoff round allows teams to test strategies, refine robot designs, and prepare for official rounds of the national championship in 2026.\n\nIn the coming months, regional qualifiers will take place in various provinces and cities, leading to the national finals and ultimately the 2026 VEX Robotics World Championship in the United States next April.",
      "url": "https://vietnamnet.vn/en/vietnam-launches-robotics-championship-to-select-teams-for-global-finals-2449097.html",
      "source": {
        "title": "VietNamNet News"
      },
      "date": "2025-10-04T03:02:37Z",
      "image": "https://static-images.vnncdn.net/vps_images_publish/000001/00000Q/2025/10/4/vietnam-launches-robotics-championship-to-select-teams-for-global-finals-1e1ed434cf7742d58f142f308483705e-532.jpg?width=0&s=UjqXZAfBNEZFTczEMUn5bA"
    },
    {
      "title": "LUG bolsters STEM commitment with AI and inclusion drive",
      "description": "Lancaster University Ghana (LUG) has reaffirmed its commitment to preparing students for the digital age by incorporating Artificial Intelligence (AI) and robotics education into its curriculum.\n\nSpeaking at a colourful graduation ceremony to celebrate the achievements of its ninth cohort of students - a milestone in the institution's mission to deliver world-class education in West Africa - the Provost and Chief Executive Officer of Lancaster University Ghana, Dr Emmanuel Arthur, highlighted several initiatives designed to position the university at the forefront of innovation.\n\n\"This year, we strengthened our place as a leading African institution. We launched the Emerging Technologies Centre, offering world-class training in robotics, with over sixty high school students benefiting,\" Dr Arthur said.\n\nHe also emphasised the university's dedication to improving female participation in Science, Technology, Engineering, and Mathematics (STEM) education. \"To promote women in STEM, a fully funded scholarship is available for an outstanding female STEM student,\" he announced.\n\nIn addition, the university has unveiled a moot court for its law programme and is preparing to launch an innovation and incubation hub to support budding entrepreneurs.\n\nThe event, held in Accra, brought together graduands, parents, faculty, alumni, and dignitaries from academia, industry, and government. It was a moment of pride and reflection, as students who had successfully completed their programmes were honoured for their academic excellence, resilience, and determination.\n\nThe graduates, who earned degrees across various disciplines, will now join the global alumni network of Lancaster University, gaining access to a community of professionals and opportunities around the world.\n\nThe ceremony also featured the recognition of outstanding students who excelled in academics, leadership, and community service, underscoring Lancaster University Ghana's holistic approach to education.\n\nSince its establishment in 2013, Lancaster University Ghana has experienced remarkable growth, producing over 700 alumni from its Accra campus. The university offers students opportunities to participate in exchange programmes and to pursue further studies abroad in countries such as the UK, China, Malaysia, Germany, and Indonesia. Its graduates have gone on to build successful careers in sectors including telecommunications, education, banking and finance, and oil and gas.\n\nThe university's growing focus on STEM education aligns with the needs of today's technology-driven world and supports the government's vision to equip young people with skills in innovation and technology.",
      "url": "https://thebftonline.com/2025/10/02/lug-bolsters-stem-commitment-with-ai-and-inclusion-drive/",
      "source": {
        "title": "The Business & Financial Times"
      },
      "date": "2025-10-02T13:47:38Z",
      "image": "https://thebftonline.com/wp-content/uploads/2025/10/LUG1.jpg"
    },
    {
      "title": "UCLA reclaims hundreds of research grants that Trump cut off over alleged antisemitism",
      "description": "The Trump administration has restored almost all of the 500 National Institutes of Health grants it suspended at UCLA in July in response to a federal judge's order last week.\n\nAttorneys in the U.S. Department of Justice submitted a court-mandated update on the status of the grant restorations Monday evening. They report that the National Institutes of Health, or NIH, has restored all but nine grants to UCLA health science researchers, though that figure may be even smaller.\n\nIn response to a similar court order in August, the federal National Science Foundation restored 300 grants it had suspended in July.\n\nThe restorations cap a remarkable turnaround for UCLA, which lost access to more than $500 million in research in July after the Trump administration froze 800 science grants to the esteemed public university. The National Science Foundation and National Institutes of Health accused UCLA of tolerating antisemitism as part of their justification for the grant funding freezes.\n\nThose claims followed months of efforts at the university to implement the recommendations of a task force on antisemitism that campus administrators appointed to examine bias at the school.\n\nThe science grants pay for research into life-saving drugs, dementia, heart disease in rural areas, robotics education and a vast array of science inquiries across the country. They help propel the country's research enterprise and are the top source of federal research grants at the University of California. The UC system has battled the Trump administration over various efforts to slash its funding since President Donald Trump's second term began. Science funding is also a key source of income and training for graduate students, who are the next generation of publicly funded academics.\n\nStill, UCLA and the rest of the UC remain in the hot seat as the system contends with settlement demands from Trump that amount to $1.2 billion. Trump sought that settlement over a litany of accusations, including that the campus tolerates antisemitism.\n\nMore than 600 Jewish faculty, students, staff and alumni of the University of California wrote in a public letter that stripping funding in response to those claims is \"misguided and punitive.\"\n\n\"Cutting off hundreds of millions of research funds will do nothing to make UCLA safer for Jews nor diminish antisemitism in the world,\" the public letter says.\n\nA coalition of UC faculty and staff have sued to halt Trump from pursuing his settlement demands.\n\nThe California federal judge who ordered the grants returned to UCLA, Rita Lin, has issued a string of decisions since June that have restored hundreds of other research grants from multiple agencies across the UC system. Her injunction last week is preliminary and the trial is ongoing. The 9th Circuit Court of Appeals has upheld some of her other preliminary injunctions that forced the Trump administration to restore scores of science, humanities and environmental research grants.\n\nLin last week also ordered the Department of Defense and Department of Transportation to restore grants to at least several dozen UC researchers, not just those at UCLA. Attorneys for the government say they need more time -- until Oct. 10 -- to bring back the defense grants, but said funding for all the terminated defense grants will be restored.\n\nLin is also the judge in the Trump settlement lawsuit.",
      "url": "https://www.record-bee.com/2025/10/02/ucla-reclaims-hundreds-of-research-grants-that-trump-cut-off-over-alleged-antisemitism/",
      "source": {
        "title": "Lake County Record-Bee"
      },
      "date": "2025-10-02T13:41:44Z",
      "image": "https://www.record-bee.com/wp-content/uploads/2018/08/LRB-Filler-PhotoCORRECT-SIZE.png"
    },
    {
      "title": "Trump administration restores UCLA research grants following judge's order",
      "description": "The Trump administration has restored almost all of the 500 National Institutes of Health grants it suspended at UCLA in July in response to a federal judge's order last week.\n\nAttorneys in the U.S. Department of Justice submitted a court-mandated update on the status of the grant restorations Monday evening. They report that the National Institutes of Health, or NIH, has restored all but nine grants to UCLA health science researchers, though that figure may be even smaller.\n\nIn response to a similar court order in August, the federal National Science Foundation restored 300 grants it had suspended in July.\n\nThe restorations cap a remarkable turnaround for UCLA, which lost access to more than $500 million in research in July after the Trump administration froze 800 science grants to the esteemed public university. The National Science Foundation and National Institutes of Health accused UCLA of tolerating antisemitism as part of their justification for the grant funding freezes. Those claims followed months of efforts at the university to implement the recommendations of a task force on antisemitism that campus administrators appointed to examine bias at the school.\n\nThe science grants pay for research into life-saving drugs, dementia, heart disease in rural areas, robotics education and a vast array of science inquiries across the country. They help propel the country's research enterprise and are the top source of federal research grants at the University of California. The UC system has battled the Trump administration over various efforts to slash its funding since President Donald Trump's second term began. Science funding is also a key source of income and training for graduate students, who are the next generation of publicly funded academics. Still, UCLA and the rest of the UC remain in the hot seat as the system contends with settlement demands from Trump that amount to $1.2 billion. Trump sought that settlement over a litany of accusations, including that the campus tolerates antisemitism.\n\nMore than 600 Jewish faculty, students, staff and alumni of the University of California wrote in a public letter that stripping funding in response to those claims is \"misguided and punitive.\"\n\n\"Cutting off hundreds of millions of research funds will do nothing to make UCLA safer for Jews nor diminish antisemitism in the world,\" the public letter says. A coalition of UC faculty and staff have sued to halt Trump from pursuing his settlement demands. The California federal judge who ordered the grants returned to UCLA, Rita Lin, has issued a string of decisions since June that have restored hundreds of other research grants from multiple agencies across the UC system. Her injunction last week is preliminary and the trial is ongoing. The 9th U.S. Circuit Court of Appeals has upheld some of her other preliminary injunctions that forced the Trump administration to restore scores of science, humanities and environmental research grants.\n\nLin last week also ordered the Department of Defense and Department of Transportation to restore grants to at least several dozen UC researchers, not just those at UCLA. Attorneys for the government say they need more time -- until Oct. 10 -- to bring back the defense grants, but said funding for all the terminated defense grants will be restored. Lin is also the judge in the Trump settlement lawsuit.",
      "url": "https://www.pressdemocrat.com/2025/09/30/trump-administration-restores-ucla-research-grants-following-judges-order/",
      "source": {
        "title": "Santa Rosa Press Democrat"
      },
      "date": "2025-10-01T17:56:35Z",
      "image": "https://www.pressdemocrat.com/wp-content/uploads/2025/10/LDN-Z-UCLA-CAMPUS-01.jpg?w=640"
    },
    {
      "title": "Judge's ruling pushes Trump administration to reinstate UCLA research grants",
      "description": "Federal funding will be flowing back to UCLA after months of disruption, with the Trump administration restoring nearly all of the National Institutes of Health grants it froze this summer under accusations of antisemitism at the university.\n\nJustice Department attorneys reportedly told the court Monday evening that the NIH has reinstated all but nine of the nearly 500 suspended grants, and that the actual number of unresolved cases may be even lower. The update followed a ruling last week from U.S. District Judge Rita Lin requiring the administration to return the money.\n\nThe decision is the latest in a series of reversals for the White House, which in July abruptly blocked more than $500 million in UCLA research funding by freezing roughly 800 grants from both the NIH and the National Science Foundation. A month later, under a separate court order, the NSF restored about 300 suspended grants.\n\nREAD ALSO: Judge orders Trump administration to restore $500M in UCLA research grants\n\nThe freeze had been justified by federal officials as a response to what they called UCLA's tolerance of antisemitism, even as the campus had been working to carry out recommendations from a university task force created to address bias against Jews.\n\nThe restoration of grants represents a major relief for UCLA scientists, whose work spans Alzheimer's treatments, cardiovascular health in rural communities, robotics education, and other projects critical to the national research enterprise. These grants also support graduate students, providing both income and training for the next generation of academics.\n\nHowever, the legal battle is far from over. UCLA and the broader UC system remain under pressure from Trump's demand for a $1.2 billion settlement tied to a wide range of allegations, including claims of antisemitism. A faculty and staff coalition has sued to stop him from pursuing that settlement.\n\nThe controversy has provoked outrage across the UC community. In an open letter signed by more than 600 Jewish faculty, students, staff, and alumni, critics argued that stripping funding does nothing to protect Jewish students.\n\nREAD ALSO: UCLA warns of research crisis after Trump administration freezes $584M in federal funding\n\n\"Cutting off hundreds of millions of research funds will do nothing to make UCLA safer for Jews nor diminish antisemitism in the world,\" the letter declared.\n\nJudge Lin, who has overseen multiple UC-related funding disputes, has issued a series of injunctions since June forcing agencies to reinstate blocked research money. The 9th U.S. Circuit Court of Appeals has upheld several of her preliminary rulings, which have restored projects in science, the humanities, and environmental research.\n\nHer most recent order went beyond UCLA, requiring the Departments of Defense and Transportation to also return dozens of UC grants. Government attorneys have asked for more time, until October 10, to reinstate the defense-related projects, but confirmed that all such grants will ultimately be restored. Lin is also presiding over the settlement case itself, which remains unresolved.",
      "url": "https://face2faceafrica.com/article/judges-ruling-pushes-trump-administration-to-reinstate-ucla-research-grants",
      "source": {
        "title": "Face2Face Africa"
      },
      "date": "2025-10-01T13:10:08Z",
      "image": "https://cdn.face2faceafrica.com/www/wp-content/uploads/2025/09/Prez-Donald-Trump.jpg"
    },
    {
      "title": "Eldor Aripov States That \"Every 25th Person on the Planet Lives and Works Outside Their Country\"",
      "description": "Tashkent, Uzbekistan (UzDaily.com) -- A delegation from Uzbekistan, led by Eldor Aripov, Director of the Institute for Strategic and Interregional Studies under the President of the Republic of Uzbekistan (ISMI), is participating in the 22nd annual session of the Valdai International Discussion Club, held in Sochi from 29 September to 2 October. The forum's theme is \"A Polycentric World: Instructions for Use.\"\n\nSpeaking at the session titled \"The Great Migration of Peoples or the Great Reorganization of States?\", Aripov emphasized that migration increasingly reflects global socio-economic processes and has become a natural part of contemporary development. He noted that, according to UN data, every 25th person on the planet lives and works outside their home country.\n\nThe ISMI director highlighted asymmetrical demographic trends in the Eurasian region. Some countries face challenges related to population aging and a decreasing share of working-age citizens, while others demonstrate stable population growth and the mass entry of young people into the labor market. These contrasting trends create conditions for mutual demographic synergy, where the needs of some countries can be balanced by the potential of others.\n\nAripov stressed that the ability of states to exchange human capital is becoming a key factor in economic growth and international competitiveness. He cited examples: in Germany, migrants contribute approximately 5% of GDP, while in Canada, the figure reaches 16%.\n\nHe further noted that the total population of Central Asian countries has already exceeded 80 million, with around 65% under the age of 30. By 2050, the region's population is projected to surpass 100 million, and the working-age population is expected to increase from 51 to 70 million. In Uzbekistan, the average age is just 28 years, and 650,000 to 700,000 young people enter the labor market annually. \"This is not just dry statistics, but a portrait of the future,\" Aripov emphasized, adding that national policy aims to turn demographic potential into a driver of economic growth.\n\nHe outlined three key directions of Uzbekistan's strategy.\n\nFirst, investment in human capital remains a priority. Over the past decade, preschool education coverage has nearly tripled, from 27% to 74%, and higher education enrollment has grown more than fivefold, from 9% to 46%. The number of universities has surpassed 220, including 35 branches of foreign institutions, raising academic standards. Special focus is given to STEM education, with over 500,000 schoolchildren engaged in advanced mathematics, informatics, and robotics. The education system is gradually adapting to the demands of the digital era. According to World Bank data cited by Aripov, the digital literacy of Uzbek youth is already comparable to that of Eastern European countries.\n\nSecond, Uzbekistan is actively promoting \"virtual migration,\" allowing citizens to work for global markets while remaining in their home country. More than 15 IT parks currently operate in the country, employing over 3,000 residents, with around 35 new registrations monthly. Digital services exports have already exceeded $900 million and are projected to reach $5 billion by 2030. Young people are the main driving force behind technological growth, with one in three startups founded by individuals under 30. This trend signifies a structural shift in the economy toward entrepreneurship and innovation.\n\nThird, Uzbekistan emphasizes a model of circular migration. The country is creating conditions for citizens to work abroad legally, gain professional experience, and apply it to national development. Tax and financial incentives are provided to returning migrants. In 2024 alone, over 700,000 labor migrants returned to the country. Simultaneously, efforts are being made to improve the quality of labor migration, with more Uzbeks choosing countries with high employment standards. The government has established centers that have trained over 150,000 people and launched digital platforms, including SkillsUz, for verifying migrant qualifications. In 2024, more than 10,000 citizens were officially employed in the EU, Saudi Arabia, and Qatar, while agreements on labor mobility have been signed with Germany, and professional and language training programs are underway with South Korea and Japan for work in agriculture, logistics, and technology sectors.\n\nAripov concluded by stressing the need to rethink migration. \"It can no longer be considered merely as a tool for short-term labor shortages; it has become a systemic foundation for economic and societal transformation, a strategic asset for national development, and an important element of regional and international cooperation,\" he said. He cautioned that unilateral restrictions and controls would push labor flows into the shadows and undermine trust between states. He called for joint standards, transparent mechanisms, and flexible agreements to ensure mutually beneficial conditions for sending and receiving countries, as well as for migrants themselves.\n\nThe forum, organized by the Valdai Club, the Council for Foreign and Defense Policy, the Russian International Affairs Council, MGIMO, and the Higher School of Economics, brought together over 140 experts from 42 countries across Europe, Asia, Africa, the Middle East, the Americas, and Central Asia. High-profile guests and speakers included Russian Foreign Minister Sergey Lavrov, Deputy Head of the Russian Presidential Administration Maxim Oreshkin, Deputy Prime Minister Alexander Novak, and Moscow Mayor Sergey Sobyanin.",
      "url": "https://www.uzdaily.uz/en/eldor-aripov-states-that-every-25th-person-on-the-planet-lives-and-works-outside-their-country/",
      "source": {
        "title": "UzDaily.uz"
      },
      "date": "2025-10-01T10:22:00Z",
      "image": "https://www.uzdaily.uz/media/filer_public/60/6f/606f25a1-7a69-4502-a2ac-ad52ebc520d1/ismi_01-10.jpg"
    },
    {
      "title": "Punjab worked but other provinces played politics over floods: Maryam",
      "description": "LAHORE: Punjab Chief Minister Maryam Nawaz on Tuesday criticised other provinces for what she described as \"playing politics\" over the devastating floods.\n\nSpeaking at a ceremony in Chakwal where scholarships and laptops were distributed among students, Maryam said: \"Punjab witnessed the worst floods, with three rivers overflowing and causing widespread destruction. Sadly, instead of helping, some provinces chose to politicise Punjab's tragedy.\"\n\nShe stressed that Punjab's ministers had remained on the ground with flood-affected communities throughout the crisis.\n\nCriticising the traditional attitude of officials, Maryam remarked: \"The job of ministers is not to sit in air-conditioned rooms or drive around in cars. People who are deprived of roads, laptops and free medicines have every right to hold their rulers accountable.\"\n\nShe announced distribution of 80,000 scholarships next year and establishment of more Centres of Excellence across the province. She announced that students from Azad Jammu and Kashmir, Gilgit-Baltistan, Balochistan, and Khyber Pakhtunkhwa would also receive scholarships and laptops under this initiative. To combat malnutrition, she announced provision of dates to students in government schools located in affected areas. She declared establishment of 6,000 STEAM (Science, Technology, Engineering, Arts & Mathematics) labs and Schools of Eminence across Punjab. For Chakwal city, she announced launch of electric buses and revealed that 118,000 Core i7 laptops will be distributed to students. She said, \"I am delighted to be among students once again. Congratulations to all the talented scholars and laptop recipients. This is not a favour; these scholarships and laptops are your right. Students have earned these through hard work and should receive them with pride.\"\n\nShe said she personally chose Chakwal as the venue for this prestigious event. She noted, \"If it were up to me, I would personally hand over scholarships to every student in Punjab.\" She recalled that 30,000 scholarships were distributed last year and deeply appreciated tireless efforts of parents, who despite limited resources, strive day and night for their children's success. She stated, \"Hard times teach us everything. Good times rarely teach anything. My resolve is to stand by every son and daughter of this province.\" She mentioned that during the recent flood crisis, the entire provincial cabinet, administration and herself worked tirelessly to aid flood victims, unlike other provinces that only held press conferences. She underscored that the crime rate in Punjab has decreased after establishment of CCD. She emphasized: \"We are working to make Punjab such an exemplary province where women feel safe and protected.\" She stressed that all scholarships and laptops are being distributed strictly on merit. No student received any benefit due to any recommendation or political affiliation. Over 27,000 applications for laptops were received from Khyber Pakhtunkhwa and Balochistan alone.\n\nShe inaugurated Punjab's first Center of Excellence School in Chakwal, constructed over 40 kanals of land at a cost of Rs650 million. The school is equipped with facilities surpassing private institutions. She highlighted, \"I have directed arranging transport for university and college students. Our goal is to eliminate all barriers on the path of attaining education.\" She shared her personal journey, mentioning her political engagement starting in 2011 and contesting her first election in 2024. She recalled the hardships she faced, including imprisonment and loss of her mother while imprisoned in Adiala Jail. She emphatically stated that such experiences strengthened her resolve. She also highlighted increased participation of girls in scholarships and laptop schemes, noting that in Rawalpindi Division, female students have outperformed males. She acknowledged social challenges being faced by female students for attaining education and stressed the need for giving them equal opportunities in all fields of life.\n\nShe noted, \"Laptops and scholarships are means for students to soar further high in every field.\" She reiterated her commitment to introducing Artificial Intelligence and Robotics education in Punjab. She cited her visits to China and Japan and pledged to provide similar or better educational environments in educational institutions across Punjab. She announced that state-of-the-art cancer treatment facilities and modern Co-Ablation machines are being introduced in Rawalpindi Division and a state-of-the-art cancer treatment centre has become functional in Sargodha.\n\nShe revealed that under 'Apni Chhat Apna Ghar' initiative, 90,000 houses are being built within just 8 months. She concluded by emphasizing that education, health, and infrastructure development remain her foremost priorities, adding that entire provincial resources will be fully utilized to fulfill students' dreams.\n\nA grand ceremony was held at the University of Chakwal, where students welcomed the CM with standing ovations. Upon her arrival, she expressed delight and mingled with students, sat among them and held conversations. The enthusiasm was palpable, as students eagerly took selfies with her. A visually-impaired student performed the national anthem on piano, and the CM presented him with a special award. In a heartwarming gesture, she personally helped another visually-impaired student off the stage. The emotional atmosphere was further charged with a patriotic song, \"Is Parcham ke Saaye Tale Hum Aik Hain\", performed by the students, bringing many to tears. Following her special instructions, a smart police contingent presented the Guard of Honour to the students.\n\nDuring the ceremony, students Arida Akhtar and Ammar Khalid shared their emotional experiences about laptop and scholarship programs. A documentary film highlighting evolution of the Laptop Scheme was also shown during the ceremony. Maryam distributed laptops and scholarship cheques among meritorious students who expressed deep gratitude and referred to her as a motherly figure. She invited Deputy Commissioner Chakwal Sarah Hayat to the stage and lauded her as a role model for young girls. She was given a comprehensive briefing on the progress and outreach of Honhaar Scholarship and Laptops Scheme, which aims to empower students through technology and financial support strictly based on merit. She was briefed that in phase one, 40,000 students were given Core i7 13th generation laptops. In phase two, 33,311 students will be given laptops. Scholarships are being given to students of government universities, colleges, medical and dental colleges on merit. In phase one of Honhaar Scholarship Program, 30,000 scholarships have been given. In phase two, 20,000 scholarships will be given to students of BS third and eighth semesters, MBBS second to fifth semesters. As many as 153,000 applications have been received for Honhaar Scholarships. Out of 130,000 verified applications, 20,000 students will be given scholarships according to merit. In phase three of Honhaar Scholarship, scholarships will be given to students of Azad Jammu and Kashmir, Gilgit-Baltistan, Balochistan and Khyber Pakhtunkhwa. Scholarships will be given to 11,510 students from Khyber Pakhtunkhwa, 4,763 from Balochistan, 1,544 from Azad Jammu and Kashmir and 1,338 from Gilgit-Baltistan. Laptops will be given to 2,535 students of Rawalpindi Division, 1,888 students of public sector universities, 207 students of government colleges and 440 students of medical universities.\n\nIt was further informed in the briefing that 886 scholarships worth Rs3.22 crore will be given in Rawalpindi Division. As many as 803 students of government universities will get scholarships worth Rs2.97 crore, 52 students of government colleges will be given scholarships worth Rs700,000 and 31 students of medical colleges will be given scholarships worth Rs2.97 crore. Students of Rawalpindi's Pir Mehr Ali Shah Barani University, Fatima Jinnah Women University, Rawalpindi Women University and Rawalpindi Medical College are being given scholarships. Students from Taxila University of Engineering and Technology, University of Chakwal and Kohsar University will receive scholarships. Students from government colleges in Rawalpindi, Jhelum, Attock and Chakwal will also be given scholarships.\n\nMaryam was accorded a warm welcome upon her arrival in Chakwal. On her way, large crowds gathered along the roadside, showering her with flowers. Party workers holding party flags, lined the streets to greet her. She waved to the public and responded to their slogans with a smile and gesture of appreciation. Some young supporters arrived on decorated horses to welcome their leader, while women and children gathered in large numbers on both sides of the road.\n\nThe chief minister inaugurated the Centre of Excellence for Boys Campus in Chakwal. She advised the students to study with dedication and aim to make their country proud. She stated, \"My heart desires to build 10 to 15 Centres of Excellence in every city across Punjab.\" She also planted a tree to formally launch a plantation campaign at the campus.\n\nShe was given a comprehensive briefing on the Centre of Excellence project. The authorities briefed her that the Chakwal campus has been established on 40 kanals of land at an estimated cost of Rs640 million. They apprised that the state-of-the-art campus facilities include modern IT and science laboratories, a multipurpose hall and a high-quality stadium. The campus also provides clean drinking water and hygienic washrooms for students. Additionally, all students are provided free textbooks.\n\nMeanwhile, on the CM's directive, a flood survey has been launched across Punjab to compensate flood victims. She congratulated the PDMA, district administration and other stakeholders for early start of flood survey. She directed commissioners, deputy commissioners and assistant commissioners to support and monitor the survey teams. She was briefed by the authorities that 1,429 flood survey teams had been mobilized in flood-affected areas in 26 districts of Punjab. The diligent and dynamic members of 1,429 flood survey teams are reaching the flood-affected areas. They said, \"Flood survey teams have collected data of 27,500 people in a few days. They have also completed survey of 48,071 acres of flood-affected land, besides obtaining data of 8,305 houses destroyed by the flood. They apprised Maryam that the survey teams had obtained records of 1,712 livestock killed during the flood. A survey to estimate losses of flood victims in Kasur would start from October 1.",
      "url": "https://www.thenews.com.pk/latest/1347636-punjab-worked-but-other-provinces-played-politics-over-floods-maryam",
      "source": {
        "title": "The News International"
      },
      "date": "2025-10-01T02:38:51Z",
      "image": "https://www.thenews.com.pk/assets/uploads/updates/2025-10-01/1347636_053138_updates.jpg"
    },
    {
      "title": "Trump administration restores research grants to UCLA following federal judge's order",
      "description": "The Trump administration has restored almost all of the 500 National Institutes of Health grants it suspended at UCLA in July in response to a federal judge's order last week.Attorneys in the U.S. Department of Justice submitted a court-mandated update on the status of the grant restorations Monday evening. They report that the National Institutes of Health, or NIH, has restored all but nine grants to UCLA health science researchers, though that figure may be even smaller.In response to a similar court order in August, the federal National Science Foundation restored 300 grants it had suspended in July.The restorations cap a remarkable turnaround for UCLA, which lost access to more than $500 million in research in July after the Trump administration froze 800 science grants to the esteemed public university. The National Science Foundation and National Institutes of Health accused UCLA of tolerating antisemitism as part of their justification for the grant funding freezes. Those claims followed months of efforts at the university to implement the recommendations of a task force on antisemitism that campus administrators appointed to examine bias at the school.The science grants pay for research into life-saving drugs, dementia, heart disease in rural areas, robotics education and a vast array of science inquiries across the country. They help propel the country's research enterprise and are the top source of federal research grants at the University of California. The UC system has battled the Trump administration over various efforts to slash its funding since President Donald Trump's second term began. Science funding is also a key source of income and training for graduate students, who are the next generation of publicly funded academics. Still, UCLA and the rest of the UC remain in the hot seat as the system contends with settlement demands from Trump that amount to $1.2 billion. Trump sought that settlement over a litany of accusations, including that the campus tolerates antisemitism.More than 600 Jewish faculty, students, staff and alumni of the University of California wrote in a public letter that stripping funding in response to those claims is \"misguided and punitive.\"\"Cutting off hundreds of millions of research funds will do nothing to make UCLA safer for Jews nor diminish antisemitism in the world,\" the public letter says. A coalition of UC faculty and staff have sued to halt Trump from pursuing his settlement demands. The California federal judge who ordered the grants returned to UCLA, Rita Lin, has issued a string of decisions since June that have restored hundreds of other research grants from multiple agencies across the UC system. Her injunction last week is preliminary and the trial is ongoing. The 9th U.S. Circuit Court of Appeals has upheld some of her other preliminary injunctions that forced the Trump administration to restore scores of science, humanities and environmental research grants.Lin last week also ordered the Department of Defense and Department of Transportation to restore grants to at least several dozen UC researchers, not just those at UCLA. Attorneys for the government say they need more time -- until Oct. 10 -- to bring back the defense grants, but said funding for all the terminated defense grants will be restored. Lin is also the judge in the Trump settlement lawsuit.___This story was originally published by CalMatters and distributed through a partnership with The Associated Press.See more coverage of top California stories here | Download our app | Subscribe to our morning newsletter | Find us on YouTube here and subscribe to our channel\n\nThe Trump administration has restored almost all of the 500 National Institutes of Health grants it suspended at UCLA in July in response to a federal judge's order last week.\n\nAttorneys in the U.S. Department of Justice submitted a court-mandated update on the status of the grant restorations Monday evening. They report that the National Institutes of Health, or NIH, has restored all but nine grants to UCLA health science researchers, though that figure may be even smaller.\n\nIn response to a similar court order in August, the federal National Science Foundation restored 300 grants it had suspended in July.\n\nThe restorations cap a remarkable turnaround for UCLA, which lost access to more than $500 million in research in July after the Trump administration froze 800 science grants to the esteemed public university. The National Science Foundation and National Institutes of Health accused UCLA of tolerating antisemitism as part of their justification for the grant funding freezes. Those claims followed months of efforts at the university to implement the recommendations of a task force on antisemitism that campus administrators appointed to examine bias at the school.\n\nThe science grants pay for research into life-saving drugs, dementia, heart disease in rural areas, robotics education and a vast array of science inquiries across the country. They help propel the country's research enterprise and are the top source of federal research grants at the University of California. The UC system has battled the Trump administration over various efforts to slash its funding since President Donald Trump's second term began. Science funding is also a key source of income and training for graduate students, who are the next generation of publicly funded academics. Still, UCLA and the rest of the UC remain in the hot seat as the system contends with settlement demands from Trump that amount to $1.2 billion. Trump sought that settlement over a litany of accusations, including that the campus tolerates antisemitism.\n\nMore than 600 Jewish faculty, students, staff and alumni of the University of California wrote in a public letter that stripping funding in response to those claims is \"misguided and punitive.\"\n\n\"Cutting off hundreds of millions of research funds will do nothing to make UCLA safer for Jews nor diminish antisemitism in the world,\" the public letter says. A coalition of UC faculty and staff have sued to halt Trump from pursuing his settlement demands. The California federal judge who ordered the grants returned to UCLA, Rita Lin, has issued a string of decisions since June that have restored hundreds of other research grants from multiple agencies across the UC system. Her injunction last week is preliminary and the trial is ongoing. The 9th U.S. Circuit Court of Appeals has upheld some of her other preliminary injunctions that forced the Trump administration to restore scores of science, humanities and environmental research grants.\n\nLin last week also ordered the Department of Defense and Department of Transportation to restore grants to at least several dozen UC researchers, not just those at UCLA. Attorneys for the government say they need more time -- until Oct. 10 -- to bring back the defense grants, but said funding for all the terminated defense grants will be restored. Lin is also the judge in the Trump settlement lawsuit.\n\n___\n\nThis story was originally published by CalMatters and distributed through a partnership with The Associated Press.",
      "url": "https://www.kcra.com/article/trump-administration-restores-research-grants-ucla/68140099",
      "source": {
        "title": "KCRA"
      },
      "date": "2025-09-30T22:30:00Z",
      "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ucla-royce-hall-credit-alton-1560214929.jpg?crop=0.990xw:0.741xh;0.00979xw,0.128xh&resize=640:*"
    },
    {
      "title": "Labor Shortages Fuel Robotics Growth in Warehouses, New Study Finds",
      "description": "A recent study by Peerless Research Group shows that labor shortages and rising labor costs remain the top reasons companies adopt robotics in warehouses and distribution centers.\n\nThe January 2025 survey, conducted for Logistics Management, Modern Materials Handling, and Supply Chain Management Review, gathered responses from 217 professionals directly involved with robotic automation. The results provide a snapshot of the industry's current state and future prospects.\n\nKey findings\n\nTop drivers of robotics adoption:\n\n* 55% cited labor availability constraints as the #1 motivator\n\n* 42% cited labor costs\n\n* Additional motivators include improving worker productivity and reducing physical strain\n\nTop robotics use cases today:\n\n* Picking (33%)\n\n* Truck loading/unloading (33%)\n\n* Packing (29%)\n\n* Sorting (25%)\n\nImpact on workers:\n\n* 55% said robotics reduces employee travel time\n\n* 50% said it reduces lifting of heavy loads\n\n* 46% said it helps create a better work environment and improves retention\n\nAdoption trends:\n\n* 48% of companies already use robots\n\n* 32% plan to adopt within the next 3 years\n\n* 43% expect to increase robotics budgets in 2025\n\nChallenges:\n\n* Only 32% have approved funding for new robotics initiatives\n\n* Companies cite integration hurdles and internal knowledge gaps as major obstacles\n\n* However, 46% are very or extremely willing to invest in robotics education\n\nWhat's next?\n\nThe study suggests that while many companies are still in the early stages of their robotics journey, momentum is building fast.\n\n\"Labor availability and costs are clearly driving the industry's robotics push,\" said Peerless Research Group. \"Companies are looking for ways to boost productivity while supporting their workforce.\"\n\nAs labor challenges persist, more companies are expected to move from pilots to full-scale deployments in the coming years.",
      "url": "https://www.supplychain247.com//article/warehouse-robotics-adoption-trends-2025",
      "source": {
        "title": "supplychain247.com"
      },
      "date": "2025-09-30T22:16:11Z",
      "image": "https://www.supplychain247.com/images/2025_article/robot-human-worker-getty2.jpg"
    }
  ]
}